blog/2021/org-mode-blog.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 10:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>使用 Org Mode 写博客</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">使用 Org Mode 写博客</h1>
</header><ol class="org-ol">
<li><a href="https://github.com/dirtysalt/dirtysalt.github.io">https://github.com/dirtysalt/dirtysalt.github.io</a></li>
<li><a href="https://www.zhangjiee.com/blog/2019/build-site-with-org-mode.html">https://www.zhangjiee.com/blog/2019/build-site-with-org-mode.html</a></li>
<li><a href="https://waychan.cn/blog/2019/blogging-with-orgmode">https://waychan.cn/blog/2019/blogging-with-orgmode</a></li>
<li><a href="https://www.shellcodes.org/Emacs/%E4%BD%BF%E7%94%A8Org-Mode%E7%94%9F%E6%88%90%E5%8D%9A%E5%AE%A2.html">使用 Org-Mode 生成博客</a></li>
</ol>

<p>
11 月 20 日，开始用 Org-mode 构建博客。
</p>

<div id="outline-container-orgf5002ac" class="outline-2">
<h2 id="orgf5002ac">如何构建</h2>
<div class="outline-text-2" id="text-orgf5002ac">
<p>
我的主要参考资料已经放在文章开头。
</p>

<p>
源文件路径： <code>~/org/</code> ，生成路径： <code>~/repo/blog/</code> 。
</p>

<p>
源文件目录结构：
</p>

<div class="org-src-container">
<pre class="src src-text">.
&#9500;&#9472;&#9472; blog
&#9474;  &#9500;&#9472;&#9472; 2018
&#9474;  &#9500;&#9472;&#9472; 2019
&#9474;  &#9500;&#9472;&#9472; 2020
&#9474;  &#9500;&#9472;&#9472; 2021
&#9474;  &#9500;&#9472;&#9472; index.org
&#9474;  &#9492;&#9472;&#9472; rss.xml
&#9500;&#9472;&#9472; gtd
&#9474;  &#9500;&#9472;&#9472; 2021-Q4.org
&#9474;  &#9492;&#9472;&#9472; index.org
&#9500;&#9472;&#9472; index.org
&#9500;&#9472;&#9472; new-blog.sh
&#9500;&#9472;&#9472; other
&#9474;  &#9500;&#9472;&#9472; blogroll.org
&#9474;  &#9500;&#9472;&#9472; feed.org
&#9474;  &#9500;&#9472;&#9472; health.org
&#9474;  &#9500;&#9472;&#9472; link.org
&#9474;  &#9500;&#9472;&#9472; listen.org
&#9474;  &#9500;&#9472;&#9472; memo.org
&#9474;  &#9500;&#9472;&#9472; read.org
&#9474;  &#9500;&#9472;&#9472; resume.org
&#9474;  &#9500;&#9472;&#9472; stories.org
&#9474;  &#9500;&#9472;&#9472; think.org
&#9474;  &#9500;&#9472;&#9472; watch.org
&#9474;  &#9492;&#9472;&#9472; wiki.org
&#9492;&#9472;&#9472; topic
   &#9500;&#9472;&#9472; coding.org
   &#9500;&#9472;&#9472; learn.org
   &#9492;&#9472;&#9472; leetcode.org
</pre>
</div>

<p>
生成路径目录结构：
</p>

<div class="org-src-container">
<pre class="src src-text">.
&#9500;&#9472;&#9472; blog
&#9500;&#9472;&#9472; CHANGELOG.md
&#9500;&#9472;&#9472; gtd
&#9500;&#9472;&#9472; images
&#9500;&#9472;&#9472; index.html
&#9500;&#9472;&#9472; Makefile
&#9500;&#9472;&#9472; other
&#9500;&#9472;&#9472; README.org
&#9500;&#9472;&#9472; rss.xml
&#9500;&#9472;&#9472; scripts
&#9474;  &#9500;&#9472;&#9472; gen-sitemap
&#9474;  &#9500;&#9472;&#9472; publish
&#9474;  &#9500;&#9472;&#9472; publish.el
&#9474;  &#9492;&#9472;&#9472; run-http-server
&#9500;&#9472;&#9472; sitemap.txt
&#9500;&#9472;&#9472; sitemap.xml
&#9500;&#9472;&#9472; theme
&#9474;  &#9500;&#9472;&#9472; link.js
&#9474;  &#9500;&#9472;&#9472; normalize.css
&#9474;  &#9500;&#9472;&#9472; org.css
&#9474;  &#9500;&#9472;&#9472; scss
&#9474;  &#9500;&#9472;&#9472; site.css
&#9474;  &#9492;&#9472;&#9472; site.css.map
&#9500;&#9472;&#9472; topic
&#9500;&#9472;&#9472; tpl
&#9474;  &#9500;&#9472;&#9472; nil-site-tpl.org
&#9474;  &#9492;&#9472;&#9472; site-tpl.org
&#9492;&#9472;&#9472; videos
</pre>
</div>

<p>
生成路径的仓库在 <a href="https://github.com/tianheg/blog">GitHub:tianheg/blog</a> 。blog 目录下的 script 文件夹里放置了生成 html 的脚本文件，tpl 文件夹下的文件内容被导入每一个博客文件：
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #857575;">#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org</span>

&#25110;&#32773;

<span style="color: #857575;">#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org</span>
</pre>
</div>

<p>
主要配置文件 <code>publish.el</code> ：
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #706565;">;; </span><span style="color: #857575;">load env</span>
(load <span style="color: #ddbc91;">"~/.emacs.d/init.el"</span>)

<span style="color: #706565;">;; </span><span style="color: #857575;">https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</span>
(<span style="color: #91a0b3;">require</span> '<span style="color: #ab85a3;">ox-publish</span>)

<span style="color: #706565;">;; </span><span style="color: #857575;">https://bastibe.de/2014-05-07-speeding-up-org-publishing.html</span>
(remove-hook 'find-file-hooks 'vc-find-file-hook 'vc-refresh-state)

(<span style="color: #91a0b3;">setq</span> org-publish-project-alist
      '((<span style="color: #ddbc91;">"pages"</span>
         <span style="color: #9fbfdf;">:base-directory</span> <span style="color: #ddbc91;">"~/org/"</span>
         <span style="color: #9fbfdf;">:publishing-directory</span> <span style="color: #ddbc91;">"~/repo/blog/"</span>
         <span style="color: #9fbfdf;">:exclude</span> <span style="color: #ddbc91;">"gtd*"</span>
         <span style="color: #9fbfdf;">:recursive</span> t
         <span style="color: #9fbfdf;">:html-head-include-default-style</span> nil
         <span style="color: #9fbfdf;">:html-head</span> <span style="color: #ddbc91;">""</span>
         <span style="color: #9fbfdf;">:publishing-function</span> org-html-publish-to-html
         <span style="color: #9fbfdf;">:html-postamble</span> nil
         <span style="color: #9fbfdf;">:with-toc</span> 't)
        (<span style="color: #ddbc91;">"site"</span> <span style="color: #9fbfdf;">:components</span> (<span style="color: #ddbc91;">"pages"</span>))))

<span style="color: #706565;">;; </span><span style="color: #857575;">(progn (profiler-start 'cpu) (org-publish-project "site") (profiler-report) (profiler-stop))</span>
(org-publish-project <span style="color: #ddbc91;">"site"</span>)
</pre>
</div>

<p>
生成 html：
</p>

<div class="org-src-container">
<pre class="src src-sh">emacs --batch --script ./scripts/publish.el
</pre>
</div>
</div>
</div>
</div>
</body>
</html>